## Исходные данные

#### Схема подключения устройств

![VTP](C:\Users\Protos\Documents\GitHub\otusnetwork\VTP DTP\VTP.png)

#### Таблица адресации

| Заголовок таблицы | Интерфейс | IP-адрес     | Маска подсети |
| ----------------- | --------- | ------------ | ------------- |
| S1                | VLAN 99   | 192.168.99.1 | 255.255.255.0 |
| S2                | VLAN 99   | 192.168.99.2 | 255.255.255.0 |
| S3                | VLAN 99   | 192.168.99.3 | 255.255.255.0 |
| PC-A              | NIC       | 192.168.10.1 | 255.255.255.0 |
| PC-B              | NIC       | 192.168.20.1 | 255.255.255.0 |
| PC-C              | NIC       | 192.168.10.2 | 255.255.255.0 |



#### Задачи

1. Настройка VTP

2. Настройка DTP

3. Добавление сетей VLAN и назначение портов

4. Настройка расширенной сети VLAN

#### Общие сведения/сценарий

По мере увеличения количества коммутаторов в сети усложняется управление сетями VLAN и магистралями. Протокол VTP позволяет сетевому администратору автоматизировать управление сетями VLAN. Автоматическое согласование магистралей между сетевыми устройствами управляется динамическим протоколом транкинга (DTP). Протокол DTP включен по умолчанию на коммутаторах Catalyst 2960 и Catalyst 3560.

В этой лабораторной работе вы настроите магистральные каналы между этими коммутаторами. Также необходимо будет настроить сервер и клиентов VTP в одном домене VTP. Кроме того, вы настроите расширенную сеть VLAN на одном из коммутаторов, назначите порты для сетей VLAN и проверите сквозное подключение к этой же VLAN.



## Настройка VTP

Все коммутаторы будут настроены на использование VTP для обновлений сетей VLAN. S2 будет настроен в качестве сервера. Коммутаторы S1 и S3 будут настроены как клиенты. Они будут входить в домен VTP **CCNA** с паролем **cisco**.

##### 1. Настройте S2 в качестве сервера VTP в домене **CCNA** с паролем **cisco**.

```
S2(config)# vtp domain CCNA

Changing VTP domain name from NULL to CCNA

S2(config)#

*Mar 1 00:03:44.193: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to CCNA.

S2(config)# vtp mode server

Device mode already VTP Server for VLANS.

S2(config)# vtp password cisco

Setting device VTP password to cisco
```

##### 2. Настройте S1 и S3 в качестве  клиентов VTP в домене **CCNA** с паролем**cisco**. Конфигурации VTP приведены ниже.

```
S1(config)# vtp domain CCNA

Changing VTP domain name from NULL to CCNA

S1(config)#

*Mar  1 00:03:44.193: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to CCNA.

S1(config)# vtp mode client

Device mode VTP client for VLANS.

S1(config)# vtp password cisco

Setting device VTP password to cisco
```

##### 3. Проверьте конфигурации VTP, введя команду **show vtp status** на всех 		коммутаторах. Статус VTP для S3 приведен ниже.

```
S3# show vtp status

VTP Version capable             : 1 to 3

VTP version running             : 1

VTP Domain Name                 : CCNA

VTP Pruning Mode                : Disabled

VTP Traps Generation            : Disabled

Device ID                       : 0cd9.96d2.3580

Configuration last modified by 0.0.0.0 at 0-0-00 00:00:00

Feature VLAN:

\--------------

VTP Operating Mode                : Client

Maximum VLANs supported locally   : 255

Number of existing VLANs          : 5

Configuration Revision            : 0

MD5 digest                        : 0x8B 0x58 0x3D 0x9D 0x64 0xBE 0xD5 0xF6

​                                    0x62 0xCB 0x4B 0x50 0xE5 0x9C 0x6F 0xF6


```

## Настройка динамического протокола транкинга (DTP)

##### 1. Настройте динамические магистральные каналы между S1 и S2.

*Введите команду **show interfaces f0/1 switchport** на коммутаторах S1 и S2.*

*Какой административный и оперативный режим у коммутационного порта f0/1?*

**Административный режим - dynamic auto**
**Оперативный режим - static access**

В режиме интерфейсной настройки установите динамический магистральный канал между S1 и S2. Поскольку по умолчанию устанавливается режим dynamic auto, то только одну сторону канала необходимо перевести в режим dynamic desirable.

```
S1(config)# interface f0/1

S1(config-if)# switchport mode dynamic desirable

S1(config-if)#

*Mar 1 00:30:45.082: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down

*Mar 1 0:30:48.102: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
```

Проверьте магистральный 		канал между коммутаторами S1 и S2 		с помощью команды **show interfaces trunk**.

```
S1# show interfaces trunk

Port       Mode             Encapsulation  Status        Native vlan

Fa0/1      desirable        802.1q         trunking      1


Port       Vlans allowed on trunk

Fa0/1      1-4094


Port       Vlans allowed and active in management domain

Fa0/1      1


Port       Vlans in spanning tree forwarding state and not pruned

Fa0/1      none


S2# show interfaces trunk

Port       Mode             Encapsulation  Status        Native vlan

Fa0/1      auto             802.1q         trunking      1


Port       Vlans allowed on trunk

Fa0/1      1-4094


Port       Vlans allowed and active in management domain

Fa0/1      1

Port       Vlans in spanning tree forwarding state and not pruned

Fa0/1      1
```

##### 2. Настройте статический магистральный канал между S1 и S3.

Между коммутаторами S1 и S3 установите статический магистральный канал с помощью команды **switchport mode trunk** в режиме интерфейсной настройки для порта F0/3.

```
S1(config)# interface f0/3

S1(config-if)# switchport mode trunk

1. 1. 1. Проверьте магистрали 		с помощью команды show interfaces trunk 		на коммутаторе S1.

S1# show interface trunk

Port       Mode             Encapsulation  Status        Native vlan

Fa0/1      desirable        802.1q         trunking      1

Fa0/3      on               802.1q         trunking      1

Port       Vlans allowed on trunk

Fa0/1      1-4094

Fa0/3      1-4094

Port       Vlans allowed and active in management domain

Fa0/1      1

Fa0/3      1

Port       Vlans in spanning tree forwarding state and not pruned

Fa0/1      none

Fa0/3      none
```

*Настройте постоянную магистраль между коммутаторами S2 и S3.*

*Запишите команды, использованные для создания статической магистрали.*

**switchport mode trunk**

**switchport nonegotiate**



## **Добавление сетей VLAN и назначение портов**

#### 1. Добавьте сети VLAN на коммутаторах.

На коммутаторе S1 добавьте сеть VLAN 10.

```
S1(config)# vlan 10
```

*Удалось ли вам создать сеть VLAN 10 на коммутаторе S1? Поясните ответ.*

**VLAN создать не получилось, потому что VTP на данном коммутаторе работает в режиме клиента, который не позволяет создавать свои VLAN.**

Добавьте следующие сети VLAN на коммутаторе S2.

| VLAN | Имя        |
| ---- | ---------- |
| 10   | Red        |
| 20   | Blue       |
| 30   | Yellow     |
| 99   | Management |

```
S2(config)# vlan 10

S2(config-vlan)# name Red

S2(config-vlan)# vlan 20

S2(config-vlan)# name Blue

S2(config-vlan)# vlan 30

S2(config-vlan)# name Yellow

S2(config-vlan)# vlan 99

S2(config-vlan)# name Management

S2(config-vlan)# end



S2# show vlan brief

 VLAN Name                             Status    Ports

---- -------------------------------- --------- -------------------------------

1   default                          active    Fa0/2, Fa0/4, Fa0/5, Fa0/6

​                                                Fa0/7, Fa0/8, Fa0/9, Fa0/10

​                                                Fa0/11, Fa0/12, Fa0/13, Fa0/14

​                                                Fa0/15, Fa0/16, Fa0/17, Fa0/18

​                                                Fa0/19, Fa0/20, Fa0/21, Fa0/22

​                                                Fa0/23, Fa0/24, Gi0/1, Gi0/2

10  Red                              active

20  Blue                             active

30  Yellow                           active

99  Management                       active

<выходные данные опущены>
```

#### 2. Проверьте обновления 	VTP на коммутаторах S1 и S3.

Так как коммутатор S2 настроен как VTP-сервер, а коммутаторы S1 и S3 настроены как VTP-клиенты, коммутаторы S1 и S3 должны получить и применить информацию о сети VLAN от коммутатора S2.

*Какие команды **show** вы использовали для проверки обновлений VTP на коммутаторах S1 и S3?*

**show vlan brief**

**show vlan**

#### 3. Назначение портов 	сетям VLAN.

На этом шаге вам предстоит связать порты с сетями VLAN и настроить IP-адреса согласно следующей таблице.

| Назначение 		портов | VLAN    | IP-адрес 		и префикс прикрепленного компьютера |
| ------------------------- | ------- | ---------------------------------------------------- |
| S1 F0/6                   | VLAN 10 | PC-A: 192.168.10.1 /24                               |
| S2 F0/18                  | VLAN 20 | PC-B: 192.168.20.1 /24                               |
| S3 F0/18                  | VLAN 10 | PC-C: 192.168.10.2 /24                               |

На коммутаторе S1 переведите порт F0/6 в режим доступа и назначьте его сети VLAN 10.

```
S1(config)# interface f0/6

S1(config-if)# switchport mode access

S1(config-if)# switchport access vlan 10
```

Повторите процедуру для порта F0/18 на коммутаторах S2 и S3. Назначьте сеть VLAN согласно данной таблице.

Назначьте IP-адреса компьютерам согласно данной таблице.

#### 4. Настройте IP-адреса 	на коммутаторах.

На коммутаторе S1 назначьте IP-адрес интерфейсу SVI для сети VLAN 99 в соответствии с таблицей адресации и активируйте интерфейс.

```
S1(config)# interface vlan 99

S1(config-if)# ip address 192.168.99.1 255.255.255.0

S1(config-fi)# no shutdown
```

Повторите шаг a для коммутаторов S2 и S3.

#### 5. Проверьте наличие сквозного соединения

*Отправьте ping-запрос с компьютера PC-B на PC-A и проверьте результат. Поясните ответ.*

**PC-A не ответил на ping-запрос, так как они находятся в разных сетях, без взаимных маршрутов**

*Отправьте ping-запрос с компьютера PC-A на PC-C и проверьте результат. Поясните ответ.*

**PC-С ответил на ping-запрос, так как они находятся в одном VLAN**

*Отправьте ping-запрос с коммутатора S1 на компьютер PC-A. Была ли проверка успешной? Поясните ответ.*

**PC-A не ответил на ping-запрос, так как они находятся в разных VLAN**

*Отправьте ping-запрос с коммутатора S2 на коммутатор S1. Была ли проверка успешной? Поясните ответ.*

**S1 ответил на ping-запрос, так как они находятся в одном VLAN**

## **Настройка сети VLAN расширенного диапазона**

Сеть VLAN расширенного диапазона — это сеть VLAN в диапазоне от 1025 до 4096. Так как сетями VLAN расширенного диапазона нельзя управлять с помощью VTP, необходимо перевести VTP в прозрачный режим. В этой части вам предстоит перевести VTP на коммутаторе S1 в прозрачный режим и создать сеть VLAN расширенного диапазона на коммутаторе S1.

#### 1. Переведите VTP на 	коммутаторе S1 в прозрачный режим.

Переведите VTP на 		коммутаторе S1 в прозрачный режим.

```
S1(config)# vtp mode transparent

Setting device to VTP Transparent mode for VLANS.

S1(config)# exit

1. 1. 1. Проверьте режим 		VTP на коммутаторе S1.

S1# show vtp status

VTP Version capable             : 1 to 3

VTP version running             : 1

VTP Domain Name                 : CCNA

VTP Pruning Mode                : Disabled

VTP Traps Generation            : Disabled

Device ID                       : 0cd9.96e2.3d00

Configuration last modified by 0.0.0.0 at 3-1-93 02:36:11


Feature VLAN:

\--------------

VTP Operating Mode                : Transparent

Maximum VLANs supported locally   : 255

Number of existing VLANs          : 9

Configuration Revision            : 0

MD5 digest                        : 0xB2 0x9A 0x11 0x5B 0xBF 0x2E 0xBF 0xAA

​                                    0x31 0x18 0xFF 0x2C 0x5E 0x54 0x0A 0xB7
```

#### 2. Настройте сеть VLAN расширенного диапазона на коммутаторе S1.

Отобразите текущие 		конфигурации сети VLAN на коммутаторе 		S1.

Создайте сеть VLAN 		2000 расширенного диапазона.

```
S1# conf t

Enter configuration commands, one per line.  End with CNTL/Z.

S1(config)# vlan 2000

S1(config-vlan)# end
```

Проверьте, что сеть 		VLAN создана правильно.

```
S1# show vlan brief

VLAN Name                             Status    Ports

---- -------------------------------- --------- -------------------------------

1   default                          active    Fa0/2, Fa0/4, Fa0/5, Fa0/7

​                                                Fa0/8, Fa0/9, Fa0/10, Fa0/11

​                                                Fa0/12, Fa0/13, Fa0/14, Fa0/15

​                                                Fa0/16, Fa0/17, Fa0/18, Fa0/19

​                                                Fa0/20, Fa0/21, Fa0/22, Fa0/23

​                                                Fa0/24, Gi0/1, Gi0/2

10  Red                              active    Fa0/6

20  Blue                             active

30  Yellow                           active

99  Management                       active

1002 fddi-default                     act/unsup

1003 token-ring-default               act/unsup

1004 fddinet-default                  act/unsup

1005 trnet-default                    act/unsup

2000 VLAN2000                         active
```



## Вопросы для повторения

*Каковы преимущества и недостатки использования VTP?*

**Преимущества - удобное распространение VLAN**

**Недостатки - ограниченный диапазон VLAN, возможность атаки.**

