

# **Лабораторная работа. Настройка HSRP**

### Топология

![HSRP](.\HSRP.png)



### Таблица адресации

| Устройство | Интерфейс  | IP-адрес        | Маска подсети   | Шлюз по умолчанию |
| ---------- | ---------- | --------------- | --------------- | ----------------- |
| R1         | e0/0       | 192.168.1.1     | 255.255.255.0   | —                 |
| R1         | S1/0 (DCE) | 10.1.1.1        | 255.255.255.252 | —                 |
| R2         | S1/0       | 10.1.1.2        | 255.255.255.252 | —                 |
| R2         | S1/1 (DCE) | 10.2.2.2        | 255.255.255.252 | —                 |
| R2         | Lo1        | 209.165.200.225 | 255.255.255.224 | —                 |
| R3         | e0/0       | 192.168.1.3     | 255.255.255.0   | —                 |
| R3         | S1/1       | 10.2.2.1        | 255.255.255.252 | —                 |
| SW1        | VLAN 1     | 192.168.1.11    | 255.255.255.0   | 192.168.1.1       |
| SW3        | VLAN 1     | 192.168.1.13    | 255.255.255.0   | 192.168.1.3       |
| PC-A       | NIC        | 192.168.1.31    | 255.255.255.0   | 192.168.1.1       |
| PC-C       | NIC        | 192.168.1.33    | 255.255.255.0   | 192.168.1.3       |

### **Задачи**

**1. Построение сети и проверка соединения**

**2. Настройка обеспечения избыточности на первом хопе с помощью HSRP**

### **Общие сведения/сценарий**

Связующее дерево обеспечивает резервирование коммутаторами в локальной сети, не допуская возникновения петель. Но оно не позволяет организовать в сети резервирование шлюзов по умолчанию для устройств конечных пользователей на случай сбоя одного из маршрутизаторов. Протоколы обеспечения избыточности на первом хопе (First Hop Redundancy Protocols, FHRP) предоставляют избыточные шлюзы по умолчанию для конечных устройств. При этом конфигурация конечного пользователя не требуется. В этой лабораторной работе вам предстоит настроить протокол Cisco HSRP, являющийся протоколом FHRP.

**Примечание**. В практических лабораторных работах CCNA используются маршрутизаторы с интегрированными сетевыми сервисами (ISR) Cisco 1941 с операционной системой Cisco IOS версии 15.2(4)M3 (образ universalk9). Также используются коммутаторы Cisco Catalyst 2960 с операционной системой Cisco IOS версии 15.0(2) (образ lanbasek9). Можно использовать другие маршрутизаторы, коммутаторы и версии Cisco IOS. В зависимости от модели устройства и версии Cisco IOS доступные команды и результаты их выполнения могут отличаться от тех, которые показаны в лабораторных работах. Точные идентификаторы интерфейсов см. в сводной таблице по интерфейсам маршрутизаторов в конце лабораторной работы.

**Примечание**. Убедитесь, что у маршрутизаторов и коммутаторов были удалены начальные конфигурации. Если вы не уверены, обратитесь к инструктору.

**Необходимые ресурсы**

- 3 маршрутизатора (Cisco 1941 с операционной системой Cisco IOS версии 15.2(4)M3 (универсальный образ) или аналогичная модель)
- 2 коммутатора (Cisco 2960 с операционной системой Cisco IOS 15.0(2) (образ lanbasek9) или аналогичная модель)
- 2 компьютера (Windows 8, 7 или Vista с программой эмуляции терминала, например Tera Term)
- Консольные кабели для настройки устройств Cisco IOS через консольные порты
- Кабели Ethernet и последовательные кабели согласно топологии

## 1. Построение сети и проверка связи

В первой части вам предстоит настроить топологию сети и выполнить базовую настройку, например IP-адреса интерфейсов, статическую маршрутизацию, доступ к устройствам и пароли.

#### 1.1 Создайте сеть согласно топологии.

Подключите устройства, как показано в топологии, и подсоедините необходимые кабели.

#### 1.2 Настройте узлы ПК.

#### 1.3 Выполните инициализацию и перезагрузку маршрутизатора и коммутаторов.

#### 1.4 Произведите базовую настройку маршрутизаторов.

Отключите поиск DNS.

```
(conf) no ip domain-lookup
```

Присвойте имена устройствам в соответствии с топологией.

```
(conf) hostname R1
```

Настройте IP-адреса для маршрутизаторов, указанных в таблице адресации.

```
(conf) interface s1/0
(conf-if) ip address 10.1.1.1 255.255.255.252
(conf-if) no shutdown
(conf-if) interface e0/0
(conf-if) ip address 192.168.1.1 255.255.255.0
(conf-if) no shutdown
```

Установите тактовую частоту на **128000** для всех последовательных интерфейсов 		маршрутизатора DCE.

```
(conf-if) clock rate 128000
```

Назначьте **class** в качестве зашифрованного пароля доступа к привилегированному режиму.

```
(conf) enable secret class
```

Назначьте **cisco** в качестве пароля консоли и VTY и включите запрос пароля при подключении.

```
(conf) line vty 0 4
(conf-line) password cisco
(conf-line) login

(conf) line console 0
(conf-line) password cisco
(conf-line) login
```

Настройте **logging synchronous**, чтобы сообщения от консоли не могли прерывать ввод команд.

```
(conf-line) logging synchronous
```

Скопируйте текущую конфигурацию в файл загрузочной конфигурации.

```
# copy run start
```

#### 1.5 Настройте базовые 	параметры каждого коммутатора.

Отключите поиск DNS.

```
 (conf) no ip domain-lookup
```

Присвойте имена устройствам в соответствии с топологией.

```
(conf) hostname SW1
```

Назначьте **class** в качестве зашифрованного пароля доступа к привилегированному режиму.

```
(conf) enable secret class
```

Настройте IP-адреса для коммутаторов, указанных в таблице адресации.

```
(conf) interface Vlan1
(conf-if)ip address 192.168.1.11 255.255.255.0
(conf-if) no shutdown
```

На каждом коммутаторе настройте шлюз по умолчанию.

```
(conf-if) ip default-gateway 192.168.1.1
```

Назначьте **cisco** в качестве пароля консоли и VTY и включите запрос пароля при подключении.

```
(conf) line vty 0 4
(conf-line) password cisco
(conf-line) login

(conf) line console 0
(conf-line) password cisco
(conf-line) login
```

Настройте **logging synchronous**, чтобы сообщения от консоли не могли прерывать ввод команд.

```
(conf-line) logging synchronous
```

Скопируйте текущую конфигурацию в файл загрузочной конфигурации.

```
# copy run start
```

#### 1.6 Проверьте подключение между PC-A и PC-C.

*Отправьте ping-запрос с компьютера PC-A на компьютер PC-C. Удалось ли получить ответ?* 

```
VPCS> ping 192.168.1.33

84 bytes from 192.168.1.33 icmp_seq=1 ttl=64 time=0.496 ms
84 bytes from 192.168.1.33 icmp_seq=2 ttl=64 time=0.649 ms
84 bytes from 192.168.1.33 icmp_seq=3 ttl=64 time=0.683 ms
84 bytes from 192.168.1.33 icmp_seq=4 ttl=64 time=0.663 ms
84 bytes from 192.168.1.33 icmp_seq=5 ttl=64 time=0.628 ms
```

**Да**

Если команды ping завершились неудачно и связь установить не удалось, исправьте ошибки в основных настройках устройства.

**Примечание.** Для успешной передачи эхо-запросов может потребоваться отключение брандмауэра.

#### 1.7 Настройте маршрутизацию.

Настройте RIP версии 2 на всех маршрутизаторах. Добавьте в процесс RIP все сети, кроме 		209.165.200.224/27.

```
(conf) router rip
(conf-router) version 2
(conf-router) network 10.1.1.0
(conf-router) network 192.168.1.0
```

Настройте маршрут по умолчанию на маршрутизаторе R2 с использованием Lo1 в качестве 		интерфейса выхода в сеть 209.165.200.224/27.

```
(conf) ip route 0.0.0.0 0.0.0.0 209.165.200.224
```

На маршрутизаторе R2 используйте следующие команды для перераспределения маршрута по умолчанию в процесс RIP.

```
R2(config)# router rip

R2(config-router)# default-information originate
```

#### 1.8 Проверьте подключение.

*Необходимо получить ответ на ping-запросы с компьютера PC-A от каждого интерфейса на маршрутизаторах R1, R2 и R3, а также от компьютера PC-C. Удалось ли получить все ответы?* 		

```
VPCS> ping 192.168.1.1

84 bytes from 192.168.1.1 icmp_seq=1 ttl=255 time=0.437 ms
84 bytes from 192.168.1.1 icmp_seq=2 ttl=255 time=0.664 ms
84 bytes from 192.168.1.1 icmp_seq=3 ttl=255 time=0.515 ms
84 bytes from 192.168.1.1 icmp_seq=4 ttl=255 time=0.512 ms
84 bytes from 192.168.1.1 icmp_seq=5 ttl=255 time=0.481 ms
```

```
VPCS> ping 192.168.1.3

84 bytes from 192.168.1.3 icmp_seq=1 ttl=255 time=0.764 ms
84 bytes from 192.168.1.3 icmp_seq=2 ttl=255 time=0.723 ms
84 bytes from 192.168.1.3 icmp_seq=3 ttl=255 time=0.749 ms
84 bytes from 192.168.1.3 icmp_seq=4 ttl=255 time=0.798 ms
84 bytes from 192.168.1.3 icmp_seq=5 ttl=255 time=0.778 ms
```

```
VPCS> ping 10.1.1.1

84 bytes from 10.1.1.1 icmp_seq=1 ttl=255 time=0.553 ms
84 bytes from 10.1.1.1 icmp_seq=2 ttl=255 time=0.522 ms
84 bytes from 10.1.1.1 icmp_seq=3 ttl=255 time=0.526 ms
84 bytes from 10.1.1.1 icmp_seq=4 ttl=255 time=0.488 ms
84 bytes from 10.1.1.1 icmp_seq=5 ttl=255 time=0.487 ms
```

```
VPCS> ping 10.1.1.2

84 bytes from 10.1.1.2 icmp_seq=1 ttl=254 time=8.919 ms
84 bytes from 10.1.1.2 icmp_seq=2 ttl=254 time=8.927 ms
84 bytes from 10.1.1.2 icmp_seq=3 ttl=254 time=8.993 ms
84 bytes from 10.1.1.2 icmp_seq=4 ttl=254 time=8.861 ms
84 bytes from 10.1.1.2 icmp_seq=5 ttl=254 time=8.816 ms
```

```
VPCS> ping 10.2.2.1

10.2.2.1 icmp_seq=1 timeout
84 bytes from 10.2.2.1 icmp_seq=2 ttl=255 time=9.210 ms
84 bytes from 10.2.2.1 icmp_seq=3 ttl=255 time=9.082 ms
84 bytes from 10.2.2.1 icmp_seq=4 ttl=255 time=9.071 ms
84 bytes from 10.2.2.1 icmp_seq=5 ttl=255 time=9.047 ms
```

```
VPCS> ping 10.2.2.2

84 bytes from 10.2.2.2 icmp_seq=1 ttl=254 time=8.946 ms
84 bytes from 10.2.2.2 icmp_seq=2 ttl=254 time=8.896 ms
84 bytes from 10.2.2.2 icmp_seq=3 ttl=254 time=8.915 ms
84 bytes from 10.2.2.2 icmp_seq=4 ttl=254 time=8.900 ms
84 bytes from 10.2.2.2 icmp_seq=5 ttl=254 time=8.994 ms
```

```
VPCS> ping 209.165.200.225

84 bytes from ping  icmp_seq=1 ttl=254 time=8.729 ms
84 bytes from 209.165.200.225 icmp_seq=2 ttl=254 time=9.054 ms
84 bytes from 209.165.200.225 icmp_seq=3 ttl=254 time=8.847 ms
84 bytes from 209.165.200.225 icmp_seq=4 ttl=254 time=8.971 ms
84 bytes from 209.165.200.225 icmp_seq=5 ttl=254 time=8.977 ms
```

**Да**

Если команды ping завершились неудачно и связь установить не удалось, исправьте ошибки в основных настройках устройства.

*Необходимо получить ответ на ping-запросы с компьютера PC-C от каждого интерфейса на маршрутизаторах R1, R2 и R3, а также от компьютера PC-A. Удалось ли получить все ответы?* 

```
VPCS> ping 192.168.1.1

84 bytes from 192.168.1.1 icmp_seq=1 ttl=255 time=0.648 ms
84 bytes from 192.168.1.1 icmp_seq=2 ttl=255 time=0.719 ms
84 bytes from 192.168.1.1 icmp_seq=3 ttl=255 time=0.798 ms
84 bytes from 192.168.1.1 icmp_seq=4 ttl=255 time=0.838 ms
84 bytes from 192.168.1.1 icmp_seq=5 ttl=255 time=0.763 ms
```

```
VPCS> ping 192.168.1.3

84 bytes from 192.168.1.3 icmp_seq=1 ttl=255 time=0.411 ms
84 bytes from 192.168.1.3 icmp_seq=2 ttl=255 time=0.439 ms
84 bytes from 192.168.1.3 icmp_seq=3 ttl=255 time=0.535 ms
84 bytes from 192.168.1.3 icmp_seq=4 ttl=255 time=0.568 ms
84 bytes from 192.168.1.3 icmp_seq=5 ttl=255 time=0.494 ms
```

```
VPCS> ping 10.1.1.1

84 bytes from 10.1.1.1 icmp_seq=1 ttl=255 time=8.973 ms
84 bytes from 10.1.1.1 icmp_seq=2 ttl=255 time=8.945 ms
84 bytes from 10.1.1.1 icmp_seq=3 ttl=255 time=8.127 ms
84 bytes from 10.1.1.1 icmp_seq=4 ttl=255 time=9.144 ms
84 bytes from 10.1.1.1 icmp_seq=5 ttl=255 time=9.025 ms
```

```
VPCS> ping 10.1.1.2

84 bytes from 10.1.1.2 icmp_seq=1 ttl=254 time=9.036 ms
84 bytes from 10.1.1.2 icmp_seq=2 ttl=254 time=8.879 ms
84 bytes from 10.1.1.2 icmp_seq=3 ttl=254 time=9.169 ms
84 bytes from 10.1.1.2 icmp_seq=4 ttl=254 time=9.022 ms
84 bytes from 10.1.1.2 icmp_seq=5 ttl=254 time=9.051 ms
```

```
VPCS> ping 10.2.2.1

84 bytes from 10.2.2.1 icmp_seq=1 ttl=255 time=0.586 ms
84 bytes from 10.2.2.1 icmp_seq=2 ttl=255 time=0.556 ms
84 bytes from 10.2.2.1 icmp_seq=3 ttl=255 time=0.480 ms
84 bytes from 10.2.2.1 icmp_seq=4 ttl=255 time=0.562 ms
84 bytes from 10.2.2.1 icmp_seq=5 ttl=255 time=0.553 ms
```

```
VPCS> ping 10.2.2.2

84 bytes from 10.2.2.2 icmp_seq=1 ttl=254 time=9.105 ms
84 bytes from 10.2.2.2 icmp_seq=2 ttl=254 time=8.958 ms
84 bytes from 10.2.2.2 icmp_seq=3 ttl=254 time=9.077 ms
84 bytes from 10.2.2.2 icmp_seq=4 ttl=254 time=9.103 ms
84 bytes from 10.2.2.2 icmp_seq=5 ttl=254 time=9.064 ms
```

```
VPCS> ping 209.165.200.225

84 bytes from 209.165.200.225 icmp_seq=1 ttl=254 time=8.944 ms
84 bytes from 209.165.200.225 icmp_seq=2 ttl=254 time=9.041 ms
84 bytes from 209.165.200.225 icmp_seq=3 ttl=254 time=9.013 ms
84 bytes from 209.165.200.225 icmp_seq=4 ttl=254 time=8.929 ms
84 bytes from 209.165.200.225 icmp_seq=5 ttl=254 time=8.966 ms
```

Если команды ping завершились неудачно и связь установить не удалось, исправьте ошибки в основных настройках устройства.

## 2. Настройка обеспечения избыточности на первом хопе с помощью HSRP

Даже если топология спроектирована с учетом избыточности (два маршрутизатора и два коммутатора в одной сети LAN), оба компьютера, PC-A и PC-C, необходимо настраивать с одним адресом шлюза. PC-A использует R1, а PC-C — R3. В случае сбоя на одном из этих маршрутизаторов или интерфейсов маршрутизаторов компьютер может потерять подключение к сети Интернет.

В части 2 вам предстоит изучить поведение сети до и после настройки протокола HSRP. Для этого вам понадобится определить путь, по которому проходят пакеты, чтобы достичь loopback-адрес на R2.

#### 2.1 Определите путь интернет-трафика для PC-A и PC-C.

В командной строке на PC-A введите команду **tracert** для loopback-адреса 209.165.200.225 на маршрутизаторе R2.

```
VPCS> trace 209.165.200.225
trace to 209.165.200.225, 8 hops max, press Ctrl+C to stop
 1   192.168.1.1   0.612 ms  0.410 ms  0.380 ms
 2   *10.1.1.2   8.899 ms (ICMP type:3, code:3, Destination port unreachable)  *
```

*Какой путь прошли пакеты от PC-A до 209.165.200.225?*

```
R1#traceroute 209.165.200.225
Type escape sequence to abort.
Tracing the route to 209.165.200.225
VRF info: (vrf in name/id, vrf out name/id)
  1 10.1.1.2 8 msec *  8 msec
```

В командной строке на PC-С введите команду **tracert** для loopback-адреса 209.165.200.225 на маршрутизаторе R2.

*Какой путь прошли пакеты от PC-C до 209.165.200.225?*

```
VPCS> trace 209.165.200.225
trace to 209.165.200.225, 8 hops max, press Ctrl+C to stop
 1   192.168.1.3   0.539 ms  0.399 ms  0.399 ms
 2   *10.2.2.2   8.939 ms (ICMP type:3, code:3, Destination port unreachable)  *
```

#### 2.2 Запустите сеанс эхо-тестирования на PC-A и разорвите соединение между S1 и R1.

В командной строке на PC-A введите команду **ping –t** для адреса **209.165.200.225** на маршрутизаторе R2. Убедитесь, что окно командной строки открыто.

**Примечание**. Чтобы прервать отправку эхо-запросов, нажмите комбинацию клавиш **Ctrl**+**C** или закройте окно командной строки.

```
C:\ ping –t 209.165.200.225

Pinging 209.165.200.225 with 32 bytes of data:

Reply from 209.165.200.225: bytes=32 time=9ms TTL=254

Reply from 209.165.200.225: bytes=32 time=9ms TTL=254

Reply from 209.165.200.225: bytes=32 time=9ms TTL=254

<выходные данные опущены>
```

В процессе эхо-тестирования отсоедините кабель Ethernet от интерфейса F0/5 на S1. Отключение интерфейса F0/5 на S1 приведет к тому же результату.

*Что произошло с трафиком эхо-запросов?*

```
84 bytes from 209.165.200.225 icmp_seq=56 ttl=254 time=8.975 ms
84 bytes from 209.165.200.225 icmp_seq=57 ttl=254 time=8.860 ms
84 bytes from 209.165.200.225 icmp_seq=58 ttl=254 time=8.757 ms
209.165.200.225 icmp_seq=59 timeout
209.165.200.225 icmp_seq=60 timeout
209.165.200.225 icmp_seq=61 timeout
209.165.200.225 icmp_seq=62 timeout
```

**Трафик перестал идти**

Какими были бы результате при повторении шагов и  на компьютере PC-C и коммутаторе 		S3?*

**Такими же**

Повторно подсоедините кабели Ethernet к интерфейсу F0/5 или включите интерфейс F0/5 на S1 и S3, соответственно. Повторно отправьте эхо-запросы на 209.165.200.225 с компьютеров PC-A и PC-C, чтобы убедиться в том, что подключение восстановлено.

#### 2.3 Настройте HSRP на R1 и R3.

В этом шаге вам предстоит настроить HSRP и изменить адрес шлюза по умолчанию на компьютерах PC-A, PC-C, S1 и коммутаторе S2 на виртуальный IP-адрес для HSRP. R1 назначается активным маршрутизатором с помощью команды приоритета HSRP.

Настройте протокол HSRP на маршрутизаторе R1.

```
R1(config)# interface g0/1

R1(config-if)# standby version 2

R1(config-if)# standby 1 ip 192.168.1.254

R1(config-if)# standby 1 priority 150

R1(config-if)# standby 1 preempt
```

Настройте протокол HSRP на маршрутизаторе R3.

```
R3(config)# interface g0/1

R3(config-if)# standby version 2

R3(config-if)# standby 1 ip 192.168.1.254
```

Проверьте HSRP, выполнив команду **show standby** на R1 и R3.

```
R1#show standby
Ethernet0/0 - Group 1 (version 2)
  State is Active
    2 state changes, last state change 00:02:08
  Virtual IP address is 192.168.1.254
  Active virtual MAC address is 0000.0c9f.f001
    Local virtual MAC address is 0000.0c9f.f001 (v2 default)
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 2.400 secs
  Preemption enabled
  Active router is local
  Standby router is 192.168.1.3, priority 100 (expires in 10.096 sec)
  Priority 150 (configured 150)
  Group name is "hsrp-Et0/0-1" (default)
```

```
R3#show standby
Ethernet0/0 - Group 1 (version 2)
  State is Standby
    1 state change, last state change 00:01:21
  Virtual IP address is 192.168.1.254
  Active virtual MAC address is 0000.0c9f.f001
    Local virtual MAC address is 0000.0c9f.f001 (v2 default)
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 2.000 secs
  Preemption disabled
  Active router is 192.168.1.1, priority 150 (expires in 8.176 sec)
    MAC address is aabb.cc00.1000
  Standby router is local
  Priority 100 (default 100)
  Group name is "hsrp-Et0/0-1" (default)
```

Используя указанные выше выходные данные, ответьте на следующие вопросы:

*Какой маршрутизатор является активным?*

**R1**

*Какой MAC-адрес используется для виртуального IP-адреса?*

**0000.0c9f.f001**

*Какой IP-адрес и приоритет используются для резервного маршрутизатора?*

**Адрес 192.168.1.3**

**Приоритет 100**

Используйте команду **show standby brief** на R1 и R3, чтобы просмотреть сводку состояния HSRP. Выходные данные приведены ниже.

```
R1#show standby brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Et0/0       1    150 P Active  local           192.168.1.3     192.168.1.254
```

```
R3#sh stan brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Et0/0       1    100   Standby 192.168.1.1     local           192.168.1.254
```

Измените адрес шлюза по умолчанию для PC-A, PC-C, S1 и S3. Какой адрес следует использовать?*

**192.168.1.254**

*Проверьте новые настройки. Отправьте эхо-запрос с PC-A и с PC-C на loopback-адрес маршрутизатора R2. Успешно ли выполнены эхо-запросы?* 

```
VPCS> ping 209.165.200.225

84 bytes from 209.165.200.225 icmp_seq=1 ttl=254 time=8.765 ms
84 bytes from 209.165.200.225 icmp_seq=2 ttl=254 time=8.868 ms
84 bytes from 209.165.200.225 icmp_seq=3 ttl=254 time=8.840 ms
84 bytes from 209.165.200.225 icmp_seq=4 ttl=254 time=9.012 ms
84 bytes from 209.165.200.225 icmp_seq=5 ttl=254 time=9.010 ms
```

```
VPCS> ping 209.165.200.225

84 bytes from 209.165.200.225 icmp_seq=1 ttl=254 time=5.491 ms
84 bytes from 209.165.200.225 icmp_seq=2 ttl=254 time=9.110 ms
84 bytes from 209.165.200.225 icmp_seq=3 ttl=254 time=9.030 ms
84 bytes from 209.165.200.225 icmp_seq=4 ttl=254 time=9.157 ms
84 bytes from 209.165.200.225 icmp_seq=5 ttl=254 time=9.137 ms
```

**Да**

#### 2.4 Запустите сеанс эхо-тестирования на PC-A и разорвите соединение с коммутатором, подключенным к активному маршрутизатору HSRP (R1).

В командной строке на PC-A введите команду **ping –t** для адреса 209.165.200.225 на маршрутизаторе R2. Убедитесь, что окно командной строки открыто.

Во время отправки эхо-запроса отсоедините кабель Ethernet от интерфейса F0/5 на коммутаторе S1 или выключите интерфейс F0/5.

*Что произошло с трафиком эхо-запросов?*

```
84 bytes from 209.165.200.225 icmp_seq=4 ttl=254 time=9.107 ms
84 bytes from 209.165.200.225 icmp_seq=5 ttl=254 time=8.900 ms
84 bytes from 209.165.200.225 icmp_seq=6 ttl=254 time=9.153 ms
84 bytes from 209.165.200.225 icmp_seq=7 ttl=254 time=6.708 ms
209.165.200.225 icmp_seq=8 timeout
209.165.200.225 icmp_seq=9 timeout
209.165.200.225 icmp_seq=10 timeout
209.165.200.225 icmp_seq=11 timeout
84 bytes from 209.165.200.225 icmp_seq=12 ttl=254 time=9.166 ms
84 bytes from 209.165.200.225 icmp_seq=13 ttl=254 time=9.121 ms
84 bytes from 209.165.200.225 icmp_seq=14 ttl=254 time=9.212 ms
84 bytes from 209.165.200.225 icmp_seq=15 ttl=254 time=9.182 ms
```

**Через 4 пропущенных пинга соединение восстановилось.**

#### 2.5 Проверьте настройки HSRP на маршрутизаторах R1 и R3.

Выполните команду **show standby brief** на маршрутизаторах R1 и R3.

*Какой маршрутизатор является активным?*

```
R3#show stanby brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Et0/0       1    100 P Active  local           unknown         192.168.1.254
```

**Активным являет R3**

Повторно подключите кабель, соединяющий коммутатор и маршрутизатор, или включите интерфейс F0/5. Какой маршрутизатор теперь является активным? Поясните ответ.*

```
R3#show stanby brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Et0/0       1    100 P Standby 192.168.1.1     local           192.168.1.254
```

**R1 так как включено приоритетное вытеснение, а у него больший приоритет чем у R3**

#### 2.6 Изменение приоритетов HSRP.

Измените приоритет HSRP на 200 на маршрутизаторе R3. Какой маршрутизатор является активным? 

Выполните команду, чтобы сделать активным маршрутизатор R3 без изменения приоритета. Какую команду вы использовали?

**standby 1 priority 200**

Используйте команду **show**, чтобы убедиться, что R3 является активным маршрутизатором.

```
R3#show standby brief
                     P indicates configured to preempt.
                     |
Interface   Grp  Pri P State   Active          Standby         Virtual IP
Et0/0       1    200 P Active  local           192.168.1.1     192.168.1.254
```

## Вопросы для повторения

*Для чего в локальной сети может потребоваться избыточность?*

**Чтобы избежать потери работоспособности сети при отказе ключевых узлов.**