# **Лабораторная работа. Настройка OSPFv2 для нескольких областей**

### **Топология**

![OSPF Multiarea](./OSPFMultiarea.png)

### **Таблица адресации**

| Устройство | Интерфейс  | IP-адрес        | Маска подсети   |
| ---------- | ---------- | --------------- | --------------- |
| R1         | Lo0        | 209.165.200.225 | 255.255.255.252 |
| R1         | Lo1        | 192.168.1.1     | 255.255.255.0   |
| R1         | Lo2        | 192.168.2.1     | 255.255.255.0   |
| R1         | S1/0 (DCE) | 192.168.12.1    | 255.255.255.252 |
|            |            |                 |                 |
| R2         | Lo6        | 192.168.6.1     | 255.255.255.0   |
| R2         | S1/0       | 192.168.12.2    | 255.255.255.252 |
| R2         | S1/1 (DCE) | 192.168.23.1    | 255.255.255.252 |
|            |            |                 |                 |
| R3         | Lo4        | 192.168.4.1     | 255.255.255.0   |
| R3         | Lo5        | 192.168.5.1     | 255.255.255.0   |
| R3         | S1/1       | 192.168.23.2    | 255.255.255.252 |

### **Задачи**

**1. Создание сети и настройка основных параметров устройства**

**2. Настройка сети OSPFv2 для нескольких областей**

**3. Настройка межобластных суммарных маршрутов**

### **Общие сведения/сценарий**

Для улучшения эффективности и масштабируемости в OSPF поддерживается иерархическая маршрутизация, использующая понятие областей. Область OSPF — это группа маршрутизаторов, использующих в своих базах данных состояний каналов (LSDB) общие и одинаковые данные о состоянии каналов. Если большая область OSPF разделена на области меньшего размера, такая архитектура называется OSPF для нескольких областей. Использование OSPF для нескольких областей является целесообразным в сетях большего размера, поскольку это позволяет сократить потребление ресурсов ЦП и памяти.

В этой лабораторной работе будет выполнена настройка сети OSPFv2 для нескольких областей с межобластными суммарными маршрутами.

**Примечание**. В практических лабораторных работах CCNA используются маршрутизаторы с интегрированными сетевыми сервисами (ISR) Cisco 1941 с операционной системой Cisco IOS версии 15.2(4)M3 (образ universalk9). Допускается использование маршрутизаторов других моделей, а также других версий операционной системы Cisco IOS. В зависимости от модели устройства и версии Cisco IOS доступные команды и результаты их выполнения могут отличаться от тех, которые показаны в лабораторных работах. Точные идентификаторы интерфейсов см. в сводной таблице по интерфейсам маршрутизаторов в конце лабораторной работы.

**Примечание**. Убедитесь, что все настройки маршрутизаторов удалены и загрузочная конфигурация отсутствует. Если вы не уверены, обратитесь к инструктору.

### **Необходимые ресурсы**

- 3 маршрутизатора (Cisco 1941 с операционной системой Cisco IOS версии 15.2(4)M3 (универсальный образ) или аналогичная модель)
- Консольные кабели для настройки устройств Cisco IOS через консольные порты
- Последовательные кабели в соответствии с топологией

### **1. Создание сети и настройка основных параметров устройства**

В части 1 необходимо настроить топологию сети и выполнить базовые настройки маршрутизаторов.

**1.1 Создайте сеть согласно топологии.**

**1.2 Выполните запуск и перезагрузку маршрутизаторов.**

**1.3 Произведите базовую настройку маршрутизаторов.**

Отключите DNS-поиск.

```
(conf) no ip domain-lookup
```

Задайте имя устройства в соответствии с топологией.

```
(conf) hostname R1
```

Назначьте **class** в качестве пароля привилегированного режима EXEC.

```
(conf) enable secret class
```

Назначьте **cisco** в качестве паролей консоли и VTY.

```
(conf) line vty 0 4
(conf-line) password cisco
(conf-line) login

(conf) line console 0
(conf-line) password cisco
(conf-line) login
```

Настройте **logging synchronous** на линии консоли.

```
(conf-line) logging synchronous
```

Настройте баннер MOTD (сообщение дня) для предупреждения пользователей о запрете 		несанкционированного доступа.

```
(conf) banner motd #Unauthorized access is prohibited#
```

Назначьте IP-адреса всем интерфейсам в соответствии с таблицей адресации. Для интерфейсов 		оборудования передачи данных (DCE) следует задать тактовую частоту 128000. Пропускную способность для всех последовательных интерфейсов следует установить равной 128 Кбит/с.

```
(conf) interface s1/0
(conf-if)ip address 192.168.12.1255.255.255.252
(conf-if) no shutdown
(conf-if) clock rate 128000
(conf-if) bandwidth 128
```

Скопируйте текущую конфигурацию в файл загрузочной конфигурации.

```
# copy run start
```

**1.4 Проверьте наличие подключения на уровне 3.**

Выполните команду **show ip interface brief**, чтобы убедиться в правильности IP-адресации и активности интерфейсов. Убедитесь, что каждый маршрутизатор может успешно отправлять эхо-запросы соседним маршрутизаторам, подключенным с помощью последовательных интерфейсов.

```
R1#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
Ethernet0/0                unassigned      YES unset  administratively down down
Ethernet0/1                unassigned      YES unset  administratively down down
Ethernet0/2                unassigned      YES unset  administratively down down
Ethernet0/3                unassigned      YES unset  administratively down down
Serial1/0                  192.168.12.1    YES manual up                    up  
Serial1/1                  unassigned      YES unset  administratively down down
Serial1/2                  unassigned      YES unset  administratively down down
Serial1/3                  unassigned      YES unset  administratively down down
Loopback0                  209.165.200.225 YES manual up                    up  
Loopback1                  192.168.1.1     YES manual up                    up  
Loopback2                  192.168.2.1     YES manual up                    up
```

```
R2#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
Ethernet0/0                unassigned      YES unset  administratively down down
Ethernet0/1                unassigned      YES unset  administratively down down
Ethernet0/2                unassigned      YES unset  administratively down down
Ethernet0/3                unassigned      YES unset  administratively down down
Serial1/0                  192.168.12.2    YES SLARP  up                    up  
Serial1/1                  192.168.23.1    YES manual up                    up  
Serial1/2                  unassigned      YES unset  administratively down down
Serial1/3                  unassigned      YES unset  administratively down down
Loopback6                  192.168.6.1     YES manual up                    up 
```

```
R3#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
Ethernet0/0                unassigned      YES unset  administratively down down
Ethernet0/1                unassigned      YES unset  administratively down down
Ethernet0/2                unassigned      YES unset  administratively down down
Ethernet0/3                unassigned      YES unset  administratively down down
Serial1/0                  unassigned      YES unset  administratively down down
Serial1/1                  192.168.23.2    YES SLARP  up                    up  
Serial1/2                  unassigned      YES unset  administratively down down
Serial1/3                  unassigned      YES unset  administratively down down
Loopback4                  192.168.4.1     YES manual up                    up  
Loopback5                  192.168.5.1     YES manual up                    up 
```

### **2. Настройка сети OSPFv2 для нескольких областей**

В части 2 необходимо настроить сеть OSPFv2 для нескольких областей, используя идентификатор процесса 1. Все интерфейсы loopback локальной сети должны быть пассивными, а для всех последовательных интерфейсов должна быть настроена аутентификация MD5 с ключом **Cisco123**.

**2.1 Определите типы маршрутизаторов OSPF в топологии.**

*Определите магистральные маршрутизаторы:* 

**R1 и R2**

*Определите граничные маршрутизаторы автономной системы (ASBR):* 

**R1**

*Определите граничные маршрутизаторы области (ABR):* 

**R1 и R2**

*Определите внутренние маршрутизаторы:*

**R3**

**2.2 Настройте протокол OSPF на маршрутизаторе R1.**

Настройте идентификатор маршрутизатора 1.1.1.1 с идентификатором процесса OSPF 1.

Добавьте OSPF для сетей маршрутизатора R1.

```
R1(config-router)# network 192.168.1.0 0.0.0.255 area 1
R1(config-router)# network 192.168.2.0 0.0.0.255 area 1
R1(config-router)# network 192.168.12.0 0.0.0.3 area 0
```

Настройте все интерфейсы loopback локальной сети, Lo1 и Lo2, как пассивные.

```
R1(config-router)#passive-interface lo1
R1(config-router)#passive-interface lo2
```

Создайте маршрут по умолчанию к сети Интернет, используя выходной интерфейс Lo0.

```
R1(config)#ip route 0.0.0.0 0.0.0.0 lo0
```

**Примечание**. Может отобразиться следующее сообщение: %Default route without gateway, if not a point-to-point interface, may impact performance (Маршрут по умолчанию настроен без шлюза, если это не интерфейс «точка-точка», производительность может снизиться). Это нормальное поведение при использовании интерфейса обратной петли для моделирования маршрута по умолчанию.

Настройте для протокола OSPF распространение маршрутов в областях OSPF.

```
R1(config-router)#default-information originate
```

**2.3 Настройте протокол OSPF на маршрутизаторе R2.**

Настройте идентификатор маршрутизатора 2.2.2.2 с идентификатором процесса OSPF 1.

```
R2(config)#router ospf 1
R2(config-router)#router-id 2.2.2.2
```

*Добавьте OSPF для сетей маршрутизатора R2. Добавьте сети в соответствующую область. Запишите использованные команды в поле ниже.*

```
R2(config-router)#network 192.168.12.1 0.0.0.3 area 0
R2(config-router)#network 192.168.12.1 0.0.0.3 area 0
*May  8 10:25:16.004: %OSPF-5-ADJCHG: Process 1, Nbr 1.1.1.1 on Serial1/0 from LOADING to FULL, Loading Done
R2(config-router)#network 192.168.23.1 0.0.0.3 area 3
R2(config-router)#network 192.168.6.1 0.0.0.255 area 3
```

Настройте все интерфейсы loopback локальных сетей как пассивные.

```
R2(config-router)#passive-interface lo6
```

**2.4 Настройте протокол OSPF на маршрутизаторе R3.**

Настройте идентификатор маршрутизатора 3.3.3.3 с идентификатором процесса OSPF 1.

```
R3(config)#router ospf 1
R3(config-router)#router-id 3.3.3.3
```

*Добавьте OSPF для сетей маршрутизатора R3. Запишите использованные команды в поле ниже.*

```
R3(config-router)#network 192.168.23.2 0.0.0.3 area 3
R3(config-router)#
*May  8 10:29:22.047: %OSPF-5-ADJCHG: Process 1, Nbr 2.2.2.2 on Serial1/1 from LOADING to FULL, Loading Done
R3(config-router)#network 192.168.4.1 0.0.0.255 area 3
R3(config-router)#network 192.168.6.1 0.0.0.255 area 3
```

Настройте все интерфейсы loopback локальных сетей как пассивные.

```
R3(config-router)#passive-interface lo4
R3(config-router)#passive-interface lo5
```

**2.5 Убедитесь в правильности настройки протокола OSPF и в установлении отношений смежности между маршрутизаторами.**

Выполните команду **show ip protocols** , чтобы проверить параметры OSPF на каждом маршрутизаторе. Используйте эту команду, чтобы определить типы маршрутизаторов OSPF и сети, назначенные каждой области.

```
R1#show ip protocols
*** IP Routing is NSF aware ***

Routing Protocol is "application"
  Sending updates every 0 seconds
  Invalid after 0 seconds, hold down 0, flushed after 0
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Maximum path: 32
  Routing for Networks:
  Routing Information Sources:
    Gateway         Distance      Last Update
  Distance: (default is 4)

Routing Protocol is "ospf 1"
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Router ID 1.1.1.1
  It is an area border and autonomous system boundary router
 Redistributing External Routes from,
  Number of areas in this router is 2. 2 normal 0 stub 0 nssa
  Maximum path: 4
  Routing for Networks:
    192.168.1.0 0.0.0.255 area 1
    192.168.2.0 0.0.0.255 area 1
    192.168.12.0 0.0.0.3 area 0
  Passive Interface(s):
    Loopback1
    Loopback2
  Routing Information Sources:
    Gateway         Distance      Last Update
    2.2.2.2              110      00:09:21
  Distance: (default is 110)
```

```
R2#show ip protocols
*** IP Routing is NSF aware ***

Routing Protocol is "application"
  Sending updates every 0 seconds
  Invalid after 0 seconds, hold down 0, flushed after 0
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Maximum path: 32
  Routing for Networks:
  Routing Information Sources:
    Gateway         Distance      Last Update
  Distance: (default is 4)

Routing Protocol is "ospf 1"
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Router ID 2.2.2.2
  It is an area border router
  Number of areas in this router is 2. 2 normal 0 stub 0 nssa
  Maximum path: 4
  Routing for Networks:
    192.168.6.0 0.0.0.255 area 3
    192.168.12.0 0.0.0.3 area 0
    192.168.23.0 0.0.0.3 area 3
  Passive Interface(s):
    Loopback6
  Routing Information Sources:
    Gateway         Distance      Last Update
    3.3.3.3              110      00:09:56
    1.1.1.1              110      00:01:50
  Distance: (default is 110)
```

```
R3#show ip protocols
*** IP Routing is NSF aware ***

Routing Protocol is "application"
  Sending updates every 0 seconds
  Invalid after 0 seconds, hold down 0, flushed after 0
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Maximum path: 32
  Routing for Networks:
  Routing Information Sources:
    Gateway         Distance      Last Update
  Distance: (default is 4)

Routing Protocol is "ospf 1"
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Router ID 3.3.3.3
  Number of areas in this router is 1. 1 normal 0 stub 0 nssa
  Maximum path: 4
  Routing for Networks:
    192.168.4.0 0.0.0.255 area 3
    192.168.5.0 0.0.0.255 area 3
    192.168.23.0 0.0.0.3 area 3
  Passive Interface(s):
    Loopback4
    Loopback5
  Routing Information Sources:
    Gateway         Distance      Last Update
    1.1.1.1              110      00:02:14
    2.2.2.2              110      00:10:48
  Distance: (default is 110)
```

*К какому типу маршрутизаторов OSPF относится каждый маршрутизатор?*

**R1: ASBR, ABR**

**R2: ABR**

**R3: Internal router**

Введите команду **show ip ospf neighbor**, чтобы убедиться в установлении отношений смежности OSPF между маршрутизаторами.

```
R1#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           0   FULL/  -        00:00:30    192.168.12.2    Serial1/0
```

```
R2# show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
1.1.1.1           0   FULL/  -        00:00:38    192.168.12.1    Serial1/0
3.3.3.3           0   FULL/  -        00:00:35    192.168.23.2    Serial1/1
```

```
R3#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           0   FULL/  -        00:00:38    192.168.23.1    Serial1/1
```

Введите команду **show ip ospf interface brief**, чтобы отобразить сводку стоимости маршрутов интерфейсов.

```
R1#show ip ospf interface brief
Interface    PID   Area            IP Address/Mask    Cost  State Nbrs F/C
Se1/0        1     0               192.168.12.1/30    781   P2P   1/1
Lo1          1     1               192.168.1.1/24     1     LOOP  0/0
Lo2          1     1               192.168.2.1/24     1     LOOP  0/0
```

```
R2#show ip ospf interface brief
Interface    PID   Area            IP Address/Mask    Cost  State Nbrs F/C
Se1/0        1     0               192.168.12.2/30    781   P2P   1/1
Lo6          1     3               192.168.6.1/24     1     LOOP  0/0
Se1/1        1     3               192.168.23.1/30    781   P2P   1/1
```

```
R3#show ip ospf interface brief
Interface    PID   Area            IP Address/Mask    Cost  State Nbrs F/C
Lo4          1     3               192.168.4.1/24     1     LOOP  0/0
Lo5          1     3               192.168.5.1/24     1     LOOP  0/0
Se1/1        1     3               192.168.23.2/30    781   P2P   1/1
```

**2.6 Настройте аутентификацию MD5 для всех последовательных интерфейсов.**

Настройте аутентификацию MD5 для OSPF на уровне интерфейса с ключом аутентификации **Cisco123**.

```
R1(config-if)#ip ospf authentication message-digest
R1(config-if)#
*May  8 10:46:13.891: %OSPF-4-NOVALIDKEY: No valid authentication send key is available on interface Serial1/0
R1(config-if)#ip ospf message-digest-key 1 md5 Cisco123
```

*Почему перед настройкой аутентификации OSPF полезно проверить правильность работы OSPF?*

**Чтобы настройка аутентификации не добавила проблем.**

**2.7 Проверьте восстановление отношений смежности OSPF.**

Снова введите команду **show ip ospf neighbor**, чтобы убедиться в восстановлении отношений смежности OSPF между маршрутизаторами после реализации аутентификации MD5. Прежде чем перейти к части 3, устраните все найденные ошибки.

```
R1#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           0   FULL/  -        00:00:39    192.168.12.2    Serial1/0
```

```
R2#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
1.1.1.1           0   FULL/  -        00:00:34    192.168.12.1    Serial1/0
3.3.3.3           0   FULL/  -        00:00:37    192.168.23.2    Serial1/1
```

```
R3#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           0   FULL/  -        00:00:33    192.168.23.1    Serial1/1
```

### **3. Настройка межобластных суммарных маршрутов**

OSPF не выполняет автоматическое объединение. Объединение межобластных маршрутов необходимо вручную настроить на маршрутизаторах ABR. В части 3 необходимо настроить на маршрутизаторах ABR суммарные межобластные маршруты. С помощью команд **show** можно будет наблюдать, каким образом объединение влияет на таблицу маршрутизации и базы данных LSDB.

**3.1 Просмотрите таблицы маршрутизации OSPF для всех маршрутизаторов.**

Введите команду **show ip route ospf** на маршрутизаторе R1. Для маршрутов OSPF, начинающихся в другой области, используется дескриптор (O IA), обозначающий межобластные маршруты.

```
R1#show ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is 0.0.0.0 to network 0.0.0.0

      192.168.4.0/32 is subnetted, 1 subnets
O IA     192.168.4.1 [110/1563] via 192.168.12.2, 00:02:08, Serial1/0
      192.168.5.0/32 is subnetted, 1 subnets
O IA     192.168.5.1 [110/1563] via 192.168.12.2, 00:02:08, Serial1/0
      192.168.6.0/32 is subnetted, 1 subnets
O IA     192.168.6.1 [110/782] via 192.168.12.2, 00:05:24, Serial1/0
      192.168.23.0/30 is subnetted, 1 subnets
O IA     192.168.23.0 [110/1562] via 192.168.12.2, 00:05:24, Serial1/0
```

*Повторите команду **show ip route ospf** для R2 и R3. Запишите маршруты OSPF между областями для каждого маршрутизатора.*

```
R2#show ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is 192.168.12.1 to network 0.0.0.0

O*E2  0.0.0.0/0 [110/1] via 192.168.12.1, 00:06:02, Serial1/0
      192.168.1.0/32 is subnetted, 1 subnets
O IA     192.168.1.1 [110/782] via 192.168.12.1, 00:06:02, Serial1/0
      192.168.2.0/32 is subnetted, 1 subnets
O IA     192.168.2.1 [110/782] via 192.168.12.1, 00:06:02, Serial1/0
      192.168.4.0/32 is subnetted, 1 subnets
O        192.168.4.1 [110/782] via 192.168.23.2, 00:02:46, Serial1/1
 	  192.168.5.0/32 is subnetted, 1 subnets
O        192.168.5.1 [110/782] via 192.168.23.2, 00:02:46, Serial1/1
```

```
R3#show ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is 192.168.23.1 to network 0.0.0.0

O*E2  0.0.0.0/0 [110/1] via 192.168.23.1, 00:03:06, Serial1/1
      192.168.1.0/32 is subnetted, 1 subnets
O IA     192.168.1.1 [110/1563] via 192.168.23.1, 00:03:06, Serial1/1
      192.168.2.0/32 is subnetted, 1 subnets
O IA     192.168.2.1 [110/1563] via 192.168.23.1, 00:03:06, Serial1/1
      192.168.6.0/32 is subnetted, 1 subnets
O        192.168.6.1 [110/782] via 192.168.23.1, 00:03:06, Serial1/1
      192.168.12.0/30 is subnetted, 1 subnets
O IA     192.168.12.0 [110/1562] via 192.168.23.1, 00:03:06, Serial1/1
```

**R2:**  **192.168.1.1 via 192.168.12.1; 192.168.1.2** **via 192.168.12.1**

**R3:** **192.168.1.1 via 192.168.23.1; 192.168.1.2** **via 192.168.23.1;** **192.168.12.0 via 192.168.23.1**

**3.2 Просмотрите базы данных LSDB на всех маршрутизаторах.**

Введите команду **show ip ospf database** на маршрутизаторе R1. Маршрутизатор ведет отдельную базу данных LSDB для каждой области, участником которой является этот маршрутизатор.

```
R1#show ip os database

            OSPF Router with ID (1.1.1.1) (Process ID 1)

                Router Link States (Area 0)

Link ID         ADV Router      Age         Seq#       Checksum Link count
1.1.1.1         1.1.1.1         653         0x8000000D 0x0025D7 2
2.2.2.2         2.2.2.2         610         0x80000005 0x00CE33 2

                Summary Net Link States (Area 0)

Link ID         ADV Router      Age         Seq#       Checksum
192.168.0.0     2.2.2.2         3606        0x80000002 0x00765B
192.168.1.1     1.1.1.1         36          0x80000001 0x00AE1E
192.168.2.1     1.1.1.1         36          0x80000001 0x00A328
192.168.4.1     2.2.2.2         7           0x80000001 0x000DA8
192.168.5.1     2.2.2.2         7           0x80000001 0x0002B2
192.168.6.1     2.2.2.2         7           0x80000001 0x00596A
192.168.23.0    2.2.2.2         91          0x80000003 0x002580

                Router Link States (Area 1)

Link ID         ADV Router      Age         Seq#       Checksum Link count
1.1.1.1         1.1.1.1         1418        0x8000000E 0x0084AC 2

                Summary Net Link States (Area 1)

Link ID         ADV Router      Age         Seq#       Checksum
192.168.0.0     1.1.1.1         3606        0x80000002 0x009441
192.168.4.1     1.1.1.1         6           0x80000001 0x00C8E0
192.168.5.1     1.1.1.1         6           0x80000001 0x00BDEA
192.168.6.1     1.1.1.1         6           0x80000001 0x0015A2
192.168.12.0    1.1.1.1         1929        0x80000009 0x00B0FD
192.168.23.0    1.1.1.1         653         0x80000002 0x00E2B7

                Type-5 AS External Link States

Link ID         ADV Router      Age         Seq#       Checksum Tag
0.0.0.0         1.1.1.1         1418        0x80000002 0x001B92 1
```

*Повторите команду **show ip ospf database** для R2 и R3. Запишите идентификаторы каналов (Link ID) для состояний суммарных сетевых каналов (Summary Net Link State) каждой области.*

```
R2#show ip ospf database

            OSPF Router with ID (2.2.2.2) (Process ID 1)

                Router Link States (Area 0)

Link ID         ADV Router      Age         Seq#       Checksum Link count
1.1.1.1         1.1.1.1         767         0x8000000D 0x0025D7 2
2.2.2.2         2.2.2.2         723         0x80000005 0x00CE33 2

                Summary Net Link States (Area 0)

Link ID         ADV Router      Age         Seq#       Checksum
192.168.1.1     1.1.1.1         150         0x80000001 0x00AE1E
192.168.2.1     1.1.1.1         150         0x80000001 0x00A328
192.168.4.1     2.2.2.2         119         0x80000001 0x000DA8
192.168.5.1     2.2.2.2         119         0x80000001 0x0002B2
192.168.6.1     2.2.2.2         119         0x80000001 0x00596A
192.168.23.0    2.2.2.2         204         0x80000003 0x002580

                Router Link States (Area 3)

Link ID         ADV Router      Age         Seq#       Checksum Link count
2.2.2.2         2.2.2.2         723         0x80000006 0x00D889 3
3.3.3.3         3.3.3.3         680         0x80000006 0x00D906 4

                Summary Net Link States (Area 3)

Link ID         ADV Router      Age         Seq#       Checksum
192.168.1.1     2.2.2.2         149         0x80000001 0x002E8A
192.168.2.1     2.2.2.2         149         0x80000001 0x002394
192.168.12.0    2.2.2.2         204         0x80000004 0x009C13

                Summary ASB Link States (Area 3)

Link ID         ADV Router      Age         Seq#       Checksum
1.1.1.1         2.2.2.2         723         0x80000002 0x00AC72

                Type-5 AS External Link States

Link ID         ADV Router      Age         Seq#       Checksum Tag
0.0.0.0         1.1.1.1         1532        0x80000002 0x001B92 1
```

```
R3#show ip ospf database

            OSPF Router with ID (3.3.3.3) (Process ID 1)

                Router Link States (Area 3)

Link ID         ADV Router      Age         Seq#       Checksum Link count
2.2.2.2         2.2.2.2         745         0x80000006 0x00D889 3
3.3.3.3         3.3.3.3         700         0x80000006 0x00D906 4

                Summary Net Link States (Area 3)

Link ID         ADV Router      Age         Seq#       Checksum
192.168.1.1     2.2.2.2         171         0x80000001 0x002E8A
192.168.2.1     2.2.2.2         171         0x80000001 0x002394
192.168.12.0    2.2.2.2         225         0x80000004 0x009C13

                Summary ASB Link States (Area 3)

Link ID         ADV Router      Age         Seq#       Checksum
1.1.1.1         2.2.2.2         745         0x80000002 0x00AC72

                Type-5 AS External Link States

Link ID         ADV Router      Age         Seq#       Checksum Tag
0.0.0.0         1.1.1.1         1554        0x80000002 0x001B92 1
```

**R2:** **area 1:192.168.1.1; 192.168.2.1; 192.168.4.1; 192.168.5.1; 192.168.6.1; 192.168.23.0**

​	   **area 0: 192.168.1.1; 192.168.2.1;192.168.12.0**



**R3: area 3: 192.168.1.1; 192.168.2.1; 192.168.12.0**



**3.3 Настройте межобластные суммарные 	маршруты.**

Рассчитайте суммарный маршрут для сетей в области.

Настройте суммарный маршрут для области 1 на маршрутизаторе R1.

```
R1(config)# router ospf 1
R1(config-router)# area 1 range 192.168.0.0 255.255.252.0
```

*Рассчитайте суммарный маршрут для сетей в области 3. Запишите результаты.*

**192.168.0.0 255.255.248.0**

*Настройте суммарный маршрут для области 3 на маршрутизаторе R2. Запишите использованные команды в отведённой ниже области.*

```
R2(config)#router ospf 1
R2(config-router)#area 3 range 192.168.0.0 255.255.248.0
```

**3.4 Повторно отобразите таблицы маршрутизации OSPF для всех маршрутизаторов.**

*Выполните команду **show ip route ospf** на каждом маршрутизаторе. Запишите результаты для суммарных и межобластных маршрутов.*

```
R1#show ip route os
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is 0.0.0.0 to network 0.0.0.0

O IA  192.168.0.0/21 [110/782] via 192.168.12.2, 00:01:17, Serial1/0
O     192.168.0.0/22 is a summary, 00:01:17, Null0
      192.168.23.0/30 is subnetted, 1 subnets
O IA     192.168.23.0 [110/1562] via 192.168.12.2, 00:01:17, Serial1/0
```

```
R2#show ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is 192.168.12.1 to network 0.0.0.0

O*E2  0.0.0.0/0 [110/1] via 192.168.12.1, 00:02:00, Serial1/0
O     192.168.0.0/21 is a summary, 00:02:00, Null0
O IA  192.168.0.0/22 [110/782] via 192.168.12.1, 00:01:50, Serial1/0
      192.168.4.0/32 is subnetted, 1 subnets
O        192.168.4.1 [110/782] via 192.168.23.2, 00:02:00, Serial1/1
      192.168.5.0/32 is subnetted, 1 subnets
O        192.168.5.1 [110/782] via 192.168.23.2, 00:02:00, Serial1/1
```

```
R3#show ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is 192.168.23.1 to network 0.0.0.0

O*E2  0.0.0.0/0 [110/1] via 192.168.23.1, 00:45:47, Serial1/1
O IA  192.168.0.0/22 [110/1563] via 192.168.23.1, 00:02:13, Serial1/1
      192.168.6.0/32 is subnetted, 1 subnets
O        192.168.6.1 [110/782] via 192.168.23.1, 00:45:47, Serial1/1
      192.168.12.0/30 is subnetted, 1 subnets
O IA     192.168.12.0 [110/1562] via 192.168.23.1, 00:45:47, Serial1/1
```

**R1:** **192.168.0.0/21 via 192.168.12.2; 192.168.23.0  via 192.168.12.2**

**R2:** **192.168.0.0/22 via 192.168.12.1**

**R3:** **192.168.0.0/22 via 192.168.23.1; 192.168.12.0 via 192.168.23.1**

**3.5 Просмотрите базы данных LSDB на всех маршрутизаторах.**

*Выполните команду **show ip route database** на каждом маршрутизаторе. Запишите идентификаторы каналов (Link ID) для состояний суммарных сетевых каналов (Summary Net Link State) каждой области.*

```
R1#show ip os database

            OSPF Router with ID (1.1.1.1) (Process ID 1)

                Router Link States (Area 0)

Link ID         ADV Router      Age         Seq#       Checksum Link count
1.1.1.1         1.1.1.1         1018        0x8000000D 0x0025D7 2
2.2.2.2         2.2.2.2         976         0x80000005 0x00CE33 2

                Summary Net Link States (Area 0)

Link ID         ADV Router      Age         Seq#       Checksum
192.168.0.0     1.1.1.1         184         0x80000001 0x00B41D
192.168.0.0     2.2.2.2         196         0x80000001 0x00824F
192.168.23.0    2.2.2.2         456         0x80000003 0x002580

                Router Link States (Area 1)

Link ID         ADV Router      Age         Seq#       Checksum Link count
1.1.1.1         1.1.1.1         1783        0x8000000E 0x0084AC 2

                Summary Net Link States (Area 1)

Link ID         ADV Router      Age         Seq#       Checksum
192.168.0.0     1.1.1.1         195         0x80000001 0x003E87
192.168.12.0    1.1.1.1         261         0x8000000A 0x00AEFE
192.168.23.0    1.1.1.1         1018        0x80000002 0x00E2B7

                Type-5 AS External Link States

Link ID         ADV Router      Age         Seq#       Checksum Tag
0.0.0.0         1.1.1.1         1783        0x80000002 0x001B92 1
```

```
R2#show ip ospf database

            OSPF Router with ID (2.2.2.2) (Process ID 1)

                Router Link States (Area 0)

Link ID         ADV Router      Age         Seq#       Checksum Link count
1.1.1.1         1.1.1.1         1042        0x8000000D 0x0025D7 2
2.2.2.2         2.2.2.2         998         0x80000005 0x00CE33 2

                Summary Net Link States (Area 0)

Link ID         ADV Router      Age         Seq#       Checksum
192.168.0.0     1.1.1.1         209         0x80000001 0x00B41D
192.168.0.0     2.2.2.2         219         0x80000001 0x00824F
192.168.23.0    2.2.2.2         479         0x80000003 0x002580

                Router Link States (Area 3)

Link ID         ADV Router      Age         Seq#       Checksum Link count
2.2.2.2         2.2.2.2         998         0x80000006 0x00D889 3
3.3.3.3         3.3.3.3         955         0x80000006 0x00D906 4

                Summary Net Link States (Area 3)

Link ID         ADV Router      Age         Seq#       Checksum
192.168.0.0     2.2.2.2         208         0x80000001 0x003489
192.168.12.0    2.2.2.2         479         0x80000004 0x009C13

                Summary ASB Link States (Area 3)

Link ID         ADV Router      Age         Seq#       Checksum
1.1.1.1         2.2.2.2         998         0x80000002 0x00AC72

                Type-5 AS External Link States

Link ID         ADV Router      Age         Seq#       Checksum Tag
0.0.0.0         1.1.1.1         1807        0x80000002 0x001B92 1
```

```
R3#show ip ospf database

            OSPF Router with ID (3.3.3.3) (Process ID 1)

                Router Link States (Area 3)

Link ID         ADV Router      Age         Seq#       Checksum Link count
2.2.2.2         2.2.2.2         1014        0x80000006 0x00D889 3
3.3.3.3         3.3.3.3         969         0x80000006 0x00D906 4

                Summary Net Link States (Area 3)

Link ID         ADV Router      Age         Seq#       Checksum
192.168.0.0     2.2.2.2         224         0x80000001 0x003489
192.168.12.0    2.2.2.2         495         0x80000004 0x009C13

                Summary ASB Link States (Area 3)

Link ID         ADV Router      Age         Seq#       Checksum
1.1.1.1         2.2.2.2         1014        0x80000002 0x00AC72

                Type-5 AS External Link States

Link ID         ADV Router      Age         Seq#       Checksum Tag
0.0.0.0         1.1.1.1         1823        0x80000002 0x001B92 1
```

**R1:** **area 0: 192.168.0.0; 192.168.23.0; **

​       **area 3: 192.168.0.0; 192.168.12.0; 192.168.23.0;**



**R2:** **area 0: 192.168.0.0; 192.168.23.0; **

​       **area 3:1 92.168.0.0; 192.168.12.0**



**R3:** **area 3: 192.168.0.0; 192.168.12.0**



*Пакет LSA какого типа передается в магистраль маршрутизатором ABR, когда включено объединение межобластных маршрутов?*

**LSA 3 типа**

**3.6 Проверьте наличие сквозного соединения.**

Убедитесь в доступности всех сетей с каждого маршрутизатора. При необходимости выполните поиск и устранение неполадок.

### **Вопросы для повторения**

*Какие три преимущества при проектировании сети предоставляет OSPF для нескольких областей?*

**Снижение вычислительной нагрузки** 

**Снижение таблицы маршрутизации**

**Снижение служебного трафика**

